Autodesk.Revit.DB.Lighting.SpotLightDistribution.TiltAngle
The tilt angle.
The tilt angle as a numerical value in radians between -PI and PI.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The angle is not valid because it is not between -180.0 and 180.0.
Since:
2013

Autodesk.Revit.DB.Lighting.SpotLightDistribution.SpotFieldAngle
The spot field angle.
The spot beam angle as a numerical value in radians between 0 and (8/9)*PI.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The angle is not valid because it is not between 1.0e-2 and 160.0.
Since:
2013

Autodesk.Revit.DB.Lighting.SpotLightDistribution.SpotBeamAngle
The spot beam angle.
The spot beam angle as a numerical value in radians between 0 and (8/9)*PI.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The angle is not valid because it is not between 1.0e-2 and 160.0.
Since:
2013

Autodesk.Revit.DB.Lighting.SpotLightDistribution.#ctor(Autodesk.Revit.DB.Lighting.SpotLightDistribution)
Creates a copy of the given spotlight distribution
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.SpotLightDistribution.#ctor(System.Double,System.Double,System.Double)
Creates a spot light distribution object with the given values.
spotBeamAngle:
The spot beam angle as a numerical value in radians between 0 and (8/9)*PI.
spotFieldAngle:
The spot field angle as a numerical value in radians between 0 and (8/9)*PI.
tiltAngle:
The tilt angle as a numerical value in radians between -PI and PI.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The angle is not valid because it is not between 1.0e-2 and 160.0.
-or-
The angle is not valid because it is not between -180.0 and 180.0.
Since:
2013

Autodesk.Revit.DB.Lighting.SpotLightDistribution.#ctor
Creates a spot light distribution object with the following values;
PI/6 radians spot beam anglePI/2 radians spot field anglePI/6 radians tilt angle
Since:
2013

Autodesk.Revit.DB.Lighting.SpotLightDistribution
This class encapsulates a spot light distribution.
Since:
2013